#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/alexandria/alexandria/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/alexandria/alexandria

To view this run in a browser, visit:
https://app.terraform.io/app/itsjoshb/alexandria/runs/run-QnaqR3fKNgjxzkq5

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_alexandria_archive: Reading...
data.archive_file.lambda_alexandria_archive: Read complete after 1s [id=700ff3e8b70b960699150056d2608c04125bd839]
aws_iam_role_policy_attachment.alexandria_lambda_execution_policy: Refreshing state... [id=alexandria_lambda_role-20230220153645139900000001]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.lambda_assume_role_policy_document: Reading...
aws_dynamodb_table.library_database: Refreshing state... [id=LibraryOfAlexandria]
data.aws_iam_policy_document.lambda_assume_role_policy_document: Read complete after 0s [id=3693445097]
data.aws_caller_identity.current: Read complete after 0s [id=304362479111]
data.aws_iam_policy_document.lambda_dynamodb_policy_document: Reading...
data.aws_iam_policy_document.lambda_dynamodb_policy_document: Read complete after 0s [id=3272885729]
aws_iam_role.lambda_role: Refreshing state... [id=alexandria_lambda_role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.lambda_dynamodb_policy will be created
  + resource "aws_iam_policy" "lambda_dynamodb_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dynamodb_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:304362479111:table/LibraryOfAlexandria"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.lambda_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_role" {
        id                    = "alexandria_lambda_role"
        name                  = "alexandria_lambda_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "alexandria_dynamodb_policy"
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.alexandria_lambda_execution_policy will be destroyed
  # (because aws_iam_role_policy_attachment.alexandria_lambda_execution_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "alexandria_lambda_execution_policy" {
      - id         = "alexandria_lambda_role-20230220153645139900000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "alexandria_lambda_role" -> null
    }

  # aws_lambda_function.alexandria_lambda will be created
  + resource "aws_lambda_function" "alexandria_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "alexandria.zip"
      + function_name                  = "Lambda_alexandria"
      + handler                        = "func"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::304362479111:role/alexandria_lambda_role"
      + runtime                        = "provided"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "9qnNqVLXHCqLQTcQCqueX2/psTDd7gqMCMCKr7N/K5w="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "RUST_LOG" = "debug"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```
</details>
*Pushed by: @buck06191, Action: `pull_request`*